# DeleteLBItem

## Description
Deletes an item from the specified list browser control.

```pascal
FUNCTION DeleteLBItem(
				dialogID    : LONGINT;
				componentID : LONGINT;
				itemIndex   : INTEGER): BOOLEAN;
```

```python
def vs.DeleteLBItem(dialogID, componentID, itemIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|itemIndex|INTEGER|the index of the item to delete|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser